; ＃＃＃＃＃＃ New Items ＃＃＃＃＃＃

[RageVest X2EquipmentTemplate]
FriendlyName="女王背心"
FriendlyNamePlural="女王背心"
BriefSummary="女王背心会引发肾上腺素的大量分泌，并帮助穿戴者产生生物合成的肌肉纤维，在短时间内赋予超人的力量。士兵应该谨慎使用这项技术，因为对人体的长期影响仍然未知。"
TacticalText="<Bullet/>增加士兵的生命值。\n<Bullet/>受到 女王背心 效果影响的士兵能够用赤手空拳发动毁灭性的近战攻击。"

[FrostHook X2WeaponTemplate]
FriendlyName="霜钩"
FriendlyNamePlural="霜钩"
BriefSummary="冰霜钩中注入了毒蛇王的冰冷毒液，可以冻结任何被其击中的敌人。它经过专门设计，可以与我们现有的任何抓钩装置相匹配。"
TacticalText="<Bullet/> 冰霜钩可用于将敌方单位从掩体中拉出。\n<Bullet/> 撞击时，冰冷的毒液会喷洒到目标上，将其冻结在原地。"

[IcarusJets X2EquipmentTemplate]
FriendlyName="伊卡洛斯喷气机"
FriendlyNamePlural="伊卡洛斯喷气机"
BriefSummary="从执政官之王身上回收的飞行组件让我们开发出了伊卡洛斯喷气装置，这是我们装甲的内置推进系统。伊卡洛斯喷气装置允许短暂飞行，使穿戴者能够快速改变位置。"
TacticalText="<Bullet/>伊卡洛斯喷气机可以让士兵立即跳转到新的位置。"

; ###### New Techs ######

[RageVest X2TechTemplate]
DisplayName="女王背心"
Summary="通过整合由狂战士样本制成的生物合成肌肉纤维以及类似于狂战士女王身上的辅助肾上腺素注射系统，可能可以制造出一件高性能的身体背心。"

[FrostHook X2TechTemplate]
DisplayName="霜钩"
Summary="通过研究毒蛇王的残骸，我们有可能从普通毒蛇腺体中合成额外的冰冷毒液。长距离抓钩将是一种优雅的解决方案，可以从安全距离释放有毒毒素。"

[IcarusJets X2TechTemplate]
DisplayName="伊卡洛斯喷气机"
Summary="凭借我们对执政官之王先进飞行机制的了解，应该可以重新利用和升级从普通执政官那里回收的喷气式飞机，为我们自己的士兵打造一个具有飞行能力的推进系统。"

; ###### Vanilla Override ######

; ＃＃＃ Abilities ＃＃＃
[IcarusJump X2AbilityTemplate]
LocFriendlyName="伊卡洛斯跳跃"
LocLongDescription="伊卡洛斯喷气机使用独特的推进系统，使我们的士兵能够立即发射到新的位置。"
LocHelpText="跳转到一个新位置。绕过所有监视和反应射击。"
LocFlyOverText="伊卡洛斯跳跃"

; ### Techs###
[AutopsyarchonKing X2TechTemplate]
DisplayName="执政官国王尸检"
Summary="瓦伦博士设法改进了这种生物的关键系统，同时又以某种方式保留了外星人精心设计的外观。虽然表面上与标准的 执政官 变体相似，但从现场看到的情况来看，该样本的飞行能力比我们以前遇到的任何生物都要先进。我们有可能将这项技术应用于我们自己的飞行推进系统。"
CodeName="代达罗斯"
LongDescription="瓦伦博士所称的改良型 执政官 变体为"阿尔法"，不仅经过基因改造，还相应升级了与其非凡能力直接相关的装备。我不得不再次质疑为原本充满敌意的外星物种提供增强攻击能力的逻辑，即使 瓦伦 有意让这些生物反抗他们的前主人。\n\n虽然我很少接触现代 执政官 的原始生物力学前身，但我可以肯定地说，瓦伦 的 阿尔法 无疑是外星人早期演绎的该物种中物理和技术最先进的。从我们的实地报告来看，该生物似乎具有一种可怕的倾向，即在迅速爬升到高空之前抓住目标，然后扔下无助的受害者。我相信我们的部队在消除这一特殊威胁方面做出了巨大贡献。R. 泰根。"

[AutopsyBerserkerQueen X2TechTemplate]
DisplayName="狂战士女王尸检"
Summary="好像标准的狂战士还不足以让我们的部队对付，这个特殊的样本已经经过了大幅改造，采用了某种辅助注射系统，使液体在其体内循环。我相信可以修改这些系统以用于我们自己的防护背心，但制造过程可能是一个挑战。"
CodeName="绿巨人"
LongDescription="尽管对被称为"贝塔"的改良狂战士变体进行了彻底检查，我仍未发现任何有意义的理由来解释 瓦伦 博士为该生物提供的增强设备与她自己的研究之间的关系。让我澄清一下，我完全理解该生物的增强内分泌系统需要添加这种补充运输和过滤机制来维持激素平衡。同时，我承认这是一个相当优雅的解决方案，可以解决一个原本令人生畏的问题。\n\n我无法理解的是，为什么 瓦伦 博士有必要将这种相对确定性超越理论阶段。这里不需要"概念证明"，最终结果对她来说无疑和现在对我来说一样清晰。我坚信她做出了有意识的决定，将她的工作进行到底，充分了解不仅对她自己而且对未来可能遇到 贝塔 的其他人的风险。我很庆幸我们当时找到了这个生物，并且我们的部队能够消除这种风险一个强大的敌人。\n\n高级职员一致认为 贝塔 的残骸最好用来制作强化防护背心，尽管实际的转化过程听起来最好由 瓦伦 博士自己来处理。R. 泰根。"

[AutopsyViperKing X2TechTemplate]
DisplayName="毒蛇王尸检"
Summary="尽管这只蝰蛇与我们经常遇到的已知蝰蛇物种明显相似，但该样本由于多种原因而显得独特，其中最重要的就是它的性别，这是迄今为止报道的唯一一只雄性蝰蛇。我们可能可以重新利用其生物学的某些方面，将其用于我们自己的武器开发计划。"
CodeName="蝎子"
LongDescription="仔细研究了 瓦伦 博士的个人研究报告的遗留部分后，我逐渐了解到她求知欲的深度以及她被野心吞噬的程度。通过逆转 毒蛇 基因结构的关键变化，即外星人故意抑制的特性，她创造了这个对象"伽马"——毒蛇"国王"。\n\n考虑到之前从未见过该物种的任何雄性成员，毒蛇 族长的想法本身就很有趣。瓦伦 推测这可能是一种有意的人口控制形式，长老们限制了他们的下属物种的繁殖能力。在看到 伽马 创造的明显筑巢地点和发现的卵（没有一个可供取样）后，我可以有信心地说，该生物确实立即开始追求早已通过基因篡改受到抑制的自然本能。\n\n到目前为止，我还没有解释 毒蛇 的毒腺受到的影响使其形态和功能发生了巨大变化；还需要进一步研究，但我已承诺允许将 伽马 的一些遗骸用于新的概念武器设计。R. 泰根。"
